IDEA StatiCa Open Model
Hanging.HangingType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of hanging
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public HangingType HangingType { get; set; }
Public Property HangingType As HangingType
	Get
	Set
public:
property HangingType HangingType {
	HangingType get ();
	void set (HangingType value);
}
Property Value
Type: HangingType
See Also
Reference
Hanging Class
IdeaRS.OpenModel.Detail Namespace